### Production environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 0s [id=196a92a2c10bfc2ffd05d0063a5f51b7]
data.azurerm_client_config.current: Reading...
data.azurerm_container_registry.main: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02MzgwYzc3OC03MDc4LTRjZjktODZiZC01YTYzNzFiMWMyYzk7b2JqZWN0SWQ9NDBhMDg1MTctZmY4MC00YjQwLWI0ZTItN2MxNjdhMTc4MjVkO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]
data.azurerm_container_registry.main: Read complete after 0s [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001]
azurerm_static_web_app.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-prod-001]
cloudflare_record.primary: Refreshing state... [id=4ae81ada11d0508bdf9e7124832420ff]
time_sleep.wait_for_dns_record: Refreshing state... [id=2025-01-03T00:03:27Z]
azurerm_static_web_app_custom_domain.primary: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-prod-001/customDomains/admin.tshort.me]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_resource.managed_certificate will be created
  + resource "azapi_resource" "managed_certificate" {
      + body                      = {
          + properties = {
              + domainControlValidation = "TXT"
              + subjectName             = "tshort.me"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "westeurope"
      + name                      = "aca-tshort-api-prod-001"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "*",
        ]
      + schema_validation_enabled = true
      + type                      = "Microsoft.App/managedEnvironments/managedCertificates@2024-03-01"
    }

  # azapi_resource_action.apply_custom_domain_binding will be created
  + resource "azapi_resource_action" "apply_custom_domain_binding" {
      + body        = {
          + properties = {
              + configuration = {
                  + ingress = {
                      + customDomains = [
                          + {
                              + bindingType   = "SniEnabled"
                              + certificateId = (known after apply)
                              + name          = "tshort.me"
                            },
                        ]
                    }
                }
            }
        }
      + id          = (known after apply)
      + method      = "PATCH"
      + output      = (known after apply)
      + resource_id = (known after apply)
      + type        = "Microsoft.App/containerApps@2024-03-01"
      + when        = "apply"
    }

  # azapi_resource_action.destroy_custom_domain_binding will be created
  + resource "azapi_resource_action" "destroy_custom_domain_binding" {
      + body        = {
          + properties = {
              + configuration = {
                  + ingress = {
                      + customDomains = []
                    }
                }
            }
        }
      + id          = (known after apply)
      + method      = "PATCH"
      + output      = (known after apply)
      + resource_id = (known after apply)
      + type        = "Microsoft.App/containerApps@2024-03-01"
      + when        = "destroy"
    }

  # azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "westeurope"
      + name                                = "appi-tshort-prod-westeurope-001"
      + resource_group_name                 = "rg-tshort-prod-westeurope-001"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "aca-tshort-api-prod-001"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-tshort-prod-westeurope-001"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + workload_profile_name         = "Consumption"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = (known after apply)
          + server   = "crtshortwesteurope001.azurecr.io"
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "crtshortwesteurope001.azurecr.io/placeholder"
              + memory            = "0.5Gi"
              + name              = "tshort-api"

              + env {
                  + name  = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + value = (sensitive value)
                }
            }
        }
    }

  # azurerm_container_app_custom_domain.api will be created
  + resource "azurerm_container_app_custom_domain" "api" {
      + container_app_environment_managed_certificate_id = (known after apply)
      + container_app_id                                 = (known after apply)
      + id                                               = (known after apply)
      + name                                             = "tshort.me"
    }

  # azurerm_container_app_environment.main will be created
  + resource "azurerm_container_app_environment" "main" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "westeurope"
      + log_analytics_workspace_id       = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "cae-tshort-prod-westeurope-001"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rg-tshort-prod-westeurope-001"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + zone_redundancy_enabled          = false

      + workload_profile {
          + name                  = "Consumption"
          + workload_profile_type = "Consumption"
        }
    }

  # azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "westeurope"
      + name                            = "log-tshort-prod-westeurope-001"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-tshort-prod-westeurope-001"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_role_assignment.api_acr_pull will be created
  + resource "azurerm_role_assignment" "api_acr_pull" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.api will be created
  + resource "azurerm_user_assigned_identity" "api" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "id-tshort-prod-westeurope-001"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-tshort-prod-westeurope-001"
      + tags                = {
          + "environment" = "Production"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + tenant_id           = (known after apply)
    }

  # cloudflare_record.api will be created
  + resource "cloudflare_record" "api" {
      + allow_overwrite = false
      + comment         = "Custom domain for the tshort API prod environment"
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tshort.me"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "196a92a2c10bfc2ffd05d0063a5f51b7"
    }

  # cloudflare_record.asuid_api will be created
  + resource "cloudflare_record" "asuid_api" {
      + allow_overwrite = false
      + comment         = "Azure custom domain verification id"
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "asuid"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "196a92a2c10bfc2ffd05d0063a5f51b7"
    }

  # time_sleep.api_custom_domain_records will be created
  + resource "time_sleep" "api_custom_domain_records" {
      + create_duration = "2m"
      + id              = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>